{"class_name": "Functional", "config": {"name": "functional_37", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 845], "dtype": "float32", "sparse": false, "ragged": false, "name": "batsman_input"}, "name": "batsman_input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "batsman_1", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "batsman_1", "inbound_nodes": [[["batsman_input", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_15", "inbound_nodes": [[["batsman_1", 0, 0, {}]]]}], "input_layers": [["batsman_input", 0, 0]], "output_layers": [["dropout_15", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}