{"class_name": "Functional", "config": {"name": "functional_212", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "history_input"}, "name": "history_input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "history_1", "trainable": true, "dtype": "float32", "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "history_1", "inbound_nodes": [[["history_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "history_2", "trainable": true, "dtype": "float32", "units": 2, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "history_2", "inbound_nodes": [[["history_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "history_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "history_output", "inbound_nodes": [[["history_2", 0, 0, {}]]]}], "input_layers": [["history_input", 0, 0]], "output_layers": [["history_output", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}