{"class_name": "Functional", "config": {"name": "functional_208", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "ragged": false, "name": "opponent_input"}, "name": "opponent_input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "opponent_1", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "opponent_1", "inbound_nodes": [[["opponent_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "oppoenent_2", "trainable": true, "dtype": "float32", "units": 15, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "oppoenent_2", "inbound_nodes": [[["opponent_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "oppoenent_3", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "oppoenent_3", "inbound_nodes": [[["oppoenent_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "oppoenent_4", "trainable": true, "dtype": "float32", "units": 5, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "oppoenent_4", "inbound_nodes": [[["oppoenent_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "opponent_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "opponent_output", "inbound_nodes": [[["oppoenent_4", 0, 0, {}]]]}], "input_layers": [["opponent_input", 0, 0]], "output_layers": [["opponent_output", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}